Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: VirtualRegistry|No artifacts to display.
sv: Inga artefakter att visa.

source: VirtualRegistry|No upstreams yet
sv: Inga uppströmskällor ännu

source: VirtualRegistry|Please provide a valid URL.
sv: Ange en giltig URL.

source: VirtualRegistry|Position of the upstream has been updated successfully.
sv: Uppströmskällans position har uppdaterats.

source: VirtualRegistry|Registries
sv: Register

source: VirtualRegistry|Registry
sv: Register

source: VirtualRegistry|Registry %{name} was successfully created.
sv: Registret %{name} har skapats.

source: VirtualRegistry|Registry %{name} was successfully updated.
sv: Registret %{name} har uppdaterats.

source: VirtualRegistry|Registry cache cleared successfully.
sv: Registrets cacheminne har rensats.

source: VirtualRegistry|Registry types
sv: Registertyper

source: VirtualRegistry|Remove upstream
sv: Ta bort uppströmskälla

source: VirtualRegistry|Remove upstream %{name}
sv: Ta bort uppströmskällan %{name}

source: VirtualRegistry|Removed upstream from virtual registry.
sv: Uppströmskällan har tagits bort från det virtuella registret.

source: VirtualRegistry|Rule:
sv: Regel:

source: VirtualRegistry|Select an upstream
sv: Välj en uppströmskälla

source: VirtualRegistry|Something went wrong while adding the upstream to virtual registry. Try again.
sv: Något gick fel när uppströmskällan skulle läggas till i det virtuella registret. Försök igen.

source: VirtualRegistry|Something went wrong while creating the upstream. Try again.
sv: Något gick fel när uppströmskällan skulle skapas. Försök igen.

source: VirtualRegistry|Storage reclaimed:
sv: Återvunnet lagringsutrymme:

source: VirtualRegistry|Summary of the cleanup
sv: Sammanfattning av rensningen

source: VirtualRegistry|Test upstream
sv: Testa uppströmskälla

source: VirtualRegistry|The cache cleanup policy has completed successfully for %{group_link}.
sv: Rensningsprincipen för cacheminnet har slutförts för %{group_link}.

source: VirtualRegistry|The scheduled cache cleanup for %{group_link} could not be completed.
sv: Den schemalagda cacheminnesrensningen för %{group_link} kunde inte slutföras.

source: VirtualRegistry|There are no container virtual registries yet
sv: Det finns inga virtuella behållarregister ännu

source: VirtualRegistry|There are no maven virtual registries yet
sv: Det finns inga virtuella Maven-register ännu

source: VirtualRegistry|This action cannot be undone. Deleting this upstream might impact registries associated with it.
sv: Åtgärden kan inte ångras. Om du tar bort uppströmskällan kan det påverka register som är associerade med den.

source: VirtualRegistry|Time in hours
sv: Tid i timmar

source: VirtualRegistry|To view summary, select an upstream.
sv: Välj en uppströmskälla för att visa sammanfattningen.

source: VirtualRegistry|Total entries removed:
sv: Totalt antal borttagna poster:

source: VirtualRegistry|URL
sv: URL

source: VirtualRegistry|Upstream
sv: Uppströmskälla

source: VirtualRegistry|Upstream %{name} was successfully deleted.
sv: Uppströmskällan %{name} har tagits bort.

source: VirtualRegistry|Upstream %{name} was successfully updated.
sv: Uppströmskällan %{name} har uppdaterats.

source: VirtualRegistry|Upstream URL
sv: Uppströms-URL

source: VirtualRegistry|Upstream added to virtual registry successfully.
sv: Uppströmskällan har lagts till i det virtuella registret.

source: VirtualRegistry|Upstream cache cleared successfully.
sv: Uppströmskällans cacheminne har rensats.

source: VirtualRegistry|Upstream created successfully.
sv: Uppströmskällan har skapats.

source: VirtualRegistry|Upstream has been deleted.
sv: Uppströmskällan har tagits bort.

source: VirtualRegistry|Upstream summary
sv: Sammanfattning för uppströmskälla

source: VirtualRegistry|Upstreams
sv: Uppströmskällor

source: VirtualRegistry|Use the arrow buttons to reorder upstreams. Artifacts are resolved from top to bottom.
sv: Använd pilknapparna för att ändra ordningen på uppströmskällor. Artefakter löses från överst till nederst.

source: VirtualRegistry|Used by registries
sv: Används av register

source: VirtualRegistry|Username (optional)
sv: Användarnamn (valfritt)

source: VirtualRegistry|View registries
sv: Visa register

source: VirtualRegistry|Virtual registry
sv: Virtuellt register

source: VirtualRegistry|Virtual registry ID copied to clipboard.
sv: Virtuellt register-ID har kopierats till urklipp.

source: VirtualRegistry|Virtual registry cache cleanup policy
sv: Rensningsprincip för virtuella registrets cacheminne

source: VirtualRegistry|Virtual registry deleted successfully.
sv: Virtuellt register har tagits bort.

source: VirtualRegistry|When you enable this feature, you accept the %{linkStart}GitLab Testing Agreement.%{linkEnd}
sv: När du aktiverar funktionen godkänner du %{linkStart}GitLabs testavtal.%{linkEnd}

source: VirtualRegistry|You can add up to %{count} registries per top-level group.
sv: Du kan lägga till upp till %{count} register per toppnivågrupp.

source: VirtualRegistry|You can add up to %{count} upstreams per registry.
sv: Du kan lägga till upp till %{count} uppströmskällor per register.

source: VirtualRegistry|You can add up to 20 registries per top-level group.
sv: Du kan lägga till upp till 20 register per toppnivågrupp.

source: VirtualRegistry|You can review the full cleanup details in the %{audit_events_link}.
sv: Du kan granska fullständig information om rensningen i %{audit_events_link}.

source: PackageRegistry|Copy Maven command
sv: Kopiera Maven-kommando

source: PackageRegistry|Copy Maven registry XML
sv: Kopiera Maven-register-XML

source: PackageRegistry|Copy NuGet Command
sv: Kopiera NuGet-kommando

source: PackageRegistry|Copy NuGet Setup Command
sv: Kopiera NuGet-konfigurationskommando

source: PackageRegistry|Copy SHA
sv: Kopiera SHA

source: PackageRegistry|Copy add Gradle Groovy DSL repository command
sv: Kopiera kommando för att lägga till Gradle Groovy DSL-lagringsplats

source: PackageRegistry|Copy add Gradle Kotlin DSL repository command
sv: Kopiera kommando för att lägga till Gradle Kotlin DSL-lagringsplats

source: PackageRegistry|Copy and paste this inside your %{codeStart}pom.xml%{codeEnd} %{codeStart}dependencies%{codeEnd} block.
sv: Kopiera och klistra in detta i blocket %{codeStart}dependencies%{codeEnd} i %{codeStart}pom.xml%{codeEnd}.

source: PackageRegistry|Copy npm command
sv: Kopiera npm-kommando

source: PackageRegistry|Copy npm setup command
sv: Kopiera npm-konfigurationskommando

source: PackageRegistry|Copy target SHA
sv: Kopiera mål-SHA

source: PackageRegistry|Copy yarn command
sv: Kopiera yarn-kommando

source: PackageRegistry|Copy yarn setup command
sv: Kopiera yarn-konfigurationskommando

source: PackageRegistry|Created by commit %{link} on branch %{branch}
sv: Skapad av incheckningen %{link} på grenen %{branch}

source: PackageRegistry|Debian
sv: Debian

source: PackageRegistry|Default
sv: Standard

source: PackageRegistry|Delete %{count} assets
sv: Ta bort %{count} resurser

source: PackageRegistry|Delete Package Version
sv: Ta bort paketversion

source: PackageRegistry|Delete asset
sv: Ta bort resurs

source: PackageRegistry|Delete package
sv: Ta bort paket

source: PackageRegistry|Delete package asset
sv: Ta bort paketresurs

source: PackageRegistry|Delete package protection rule
sv: Ta bort paketets skyddsregel

source: PackageRegistry|Delete package protection rule?
sv: Vill du ta bort paketets skyddsregel?

source: PackageRegistry|Delete package version
sv: Ta bort paketversion

source: PackageRegistry|Delete packages
sv: Ta bort paket

source: PackageRegistry|Delete selected
sv: Ta bort valda

source: PackageRegistry|Delete this package
sv: Ta bort det här paketet

source: PackageRegistry|Deleting all package assets will remove version %{version} of %{name}. Are you sure?
sv: Om du tar bort alla paketresurser tas version %{version} av %{name} bort. Är du säker?

source: PackageRegistry|Deleting the last package asset will remove version %{version} of %{name}. Are you sure?
sv: Om du tar bort den sista paketresursen tas version %{version} av %{name} bort. Är du säker?

source: PackageRegistry|Developer (default)
sv: Utvecklare (standard)

source: PackageRegistry|Duplicate packages
sv: Dubblettpaket

source: PackageRegistry|Edit protection rule
sv: Redigera skyddsregel

source: PackageRegistry|Enforce %{packageType} setting for all subgroups
sv: Tillämpa inställningen %{packageType} för alla undergrupper

source: PackageRegistry|Enforce %{package_type} setting for all subgroups
sv: Tillämpa inställningen %{package_type} för alla undergrupper

source: PackageRegistry|Error
sv: Fel

source: PackageRegistry|Error publishing
sv: Publiceringsfel

source: PackageRegistry|Examples of assets include .pom & .jar files
sv: Exempel på resurser är .pom- och .jar-filer

source: PackageRegistry|Failed to load the package data
sv: Det gick inte att läsa in paketdata

source: PackageRegistry|Failed to load version data
sv: Det gick inte att läsa in versionsdata

source: PackageRegistry|Failed to publish %{count} packages. Delete these packages and try again.
sv: Det gick inte att publicera %{count} paket. Ta bort paketen och försök igen.

source: PackageRegistry|For more information on the Conan registry, %{linkStart}see the documentation%{linkEnd}.
sv: Mer information om Conan-registret finns i %{linkStart}dokumentationen%{linkEnd}.

source: PackageRegistry|For more information on the Maven registry, %{linkStart}see the documentation%{linkEnd}.
sv: Mer information om Maven-registret finns i %{linkStart}dokumentationen%{linkEnd}.

source: PackageRegistry|For more information on the NuGet registry, %{linkStart}see the documentation%{linkEnd}.
sv: Mer information om NuGet-registret finns i %{linkStart}dokumentationen%{linkEnd}.

source: PackageRegistry|Forward %{packageType} package requests
sv: Vidarebefordra paketbegäranden för %{packageType}

source: PackageRegistry|Forward %{package_type} package requests
sv: Vidarebefordra paketbegäranden för %{package_type}

source: PackageRegistry|Forward package requests
sv: Vidarebefordra paketbegäranden

source: PackageRegistry|Forward package requests to a public registry if the packages are not found in the GitLab package registry.
sv: Vidarebefordra paketbegäranden till ett offentligt register om paketen inte finns i GitLabs paketregister.

source: PackageRegistry|Generic
sv: Allmänt

source: PackageRegistry|Gradle Groovy DSL
sv: Gradle Groovy DSL

source: PackageRegistry|Gradle Groovy DSL install command
sv: Gradle Groovy DSL-installationskommando

source: PackageRegistry|Gradle Kotlin DSL
sv: Gradle Kotlin DSL

source: PackageRegistry|Gradle Kotlin DSL install command
sv: Gradle Kotlin DSL-installationskommando

source: PackageRegistry|Group-level
sv: På gruppnivå

source: PackageRegistry|Helm
sv: Helm

source: PackageRegistry|Hidden
sv: Dold

source: PackageRegistry|If you haven't already done so, add the configuration below to your %{codeStart}.pypirc%{codeEnd} file.
sv: Om du inte redan har gjort det lägger du till konfigurationen nedan i filen %{codeStart}.pypirc%{codeEnd}.

source: PackageRegistry|If you haven't already, add the configuration below to your %{codeStart}pom.xml%{codeEnd} file.
sv: Om du inte redan har gjort det lägger du till konfigurationen nedan i filen %{codeStart}pom.xml%{codeEnd}.

source: PackageRegistry|Install
sv: Installera

source: PackageRegistry|Install package version
sv: Installera paketversion

source: PackageRegistry|Installation Method
sv: Installationsmetod

source: PackageRegistry|Instance-level
sv: På instansnivå

source: PackageRegistry|Invalid Package: failed metadata extraction
sv: Ogiltigt paket: det gick inte att extrahera metadata

source: PackageRegistry|Keywords: %{keywords}
sv: Nyckelord: %{keywords}

source: PackageRegistry|Last downloaded %{dateTime}
sv: Senast nedladdad %{dateTime}

source: PackageRegistry|Learn how to %{noPackagesLinkStart}publish and share your packages%{noPackagesLinkEnd} with GitLab.
sv: Lär dig att %{noPackagesLinkStart}publicera och dela paket%{noPackagesLinkEnd} med GitLab.

source: PackageRegistry|License information located at %{link}
sv: Licensinformation finns på %{link}

source: PackageRegistry|Machine learning model
sv: Maskininlärningsmodell

source: PackageRegistry|Maintainer (default)
sv: Underhållare (standard)

source: PackageRegistry|Manage storage used by package assets
sv: Hantera lagringsutrymme som används av paketresurser

source: PackageRegistry|Manually published
sv: Publicerad manuellt

source: PackageRegistry|Maven
sv: Maven

source: PackageRegistry|Maven Command
sv: Maven-kommando

source: PackageRegistry|Maven XML
sv: Maven XML

source: PackageRegistry|Minimum access level for delete
sv: Minsta åtkomstnivå för borttagning

source: PackageRegistry|Minimum access level for push
sv: Minsta åtkomstnivå för push

source: PackageRegistry|MlModel
sv: MlModel

source: PackageRegistry|Name pattern
sv: Namnmönster

source: PackageRegistry|No packages are protected.
sv: Inga paket är skyddade.

source: PackageRegistry|Npm
sv: Npm

source: PackageRegistry|NuGet
sv: NuGet

source: PackageRegistry|NuGet Command
sv: NuGet-kommando

source: PackageRegistry|Number of duplicate assets to keep
sv: Antal dubblettresurser att behålla

source: PackageRegistry|Other versions
sv: Andra versioner

source: PackageRegistry|Package asset deleted successfully
sv: Paketresursen har tagits bort.

source: PackageRegistry|Package assets deleted successfully
sv: Paketresurserna har tagits bort.

source: PackageRegistry|Package deleted successfully
sv: Paketet har tagits bort.

source: PackageRegistry|Package formats
sv: Paketformat

source: PackageRegistry|Package forwarding
sv: Paketvidarebefordran

source: PackageRegistry|Package protection rule created.
sv: Paketets skyddsregel har skapats.

source: PackageRegistry|Package protection rule deleted.
sv: Paketets skyddsregel har tagits bort.

source: PackageRegistry|Package registry
sv: Paketregister

source: PackageRegistry|Package updated by commit %{link} on branch %{branch}, built by pipeline %{pipeline}, and published to the registry %{datetime}
sv: Paketet uppdaterades av incheckningen %{link} på grenen %{branch}, byggdes av pipeline %{pipeline} och publicerades i registret %{datetime}

source: PackageRegistry|Packages
sv: Paket

source: PackageRegistry|Packages and assets cleanup is ready to be executed when the next cleanup job runs.
sv: Rensning av paket och resurser är klar att köras när nästa rensningsjobb körs.

source: PackageRegistry|Packages and assets will not be deleted until cleanup runs in %{nextRunAt}.
sv: Paket och resurser tas inte bort förrän rensningen körs %{nextRunAt}.

source: PackageRegistry|Packages deleted successfully
sv: Paketen har tagits bort.

source: PackageRegistry|Pending deletion
sv: Väntar på borttagning

source: PackageRegistry|Permanently delete
sv: Ta bort permanent

source: PackageRegistry|Permanently delete assets
sv: Ta bort resurser permanent

source: PackageRegistry|Processing
sv: Bearbetar

source: PackageRegistry|Project-level
sv: På projektnivå

source: PackageRegistry|Protected packages
sv: Skyddade paket

source: PackageRegistry|Publish packages if their name or version matches this regex.
sv: Publicera paket om deras namn eller version matchar det här reguljära uttrycket.

source: PackageRegistry|Published %{date}
sv: Publicerad %{date}

source: PackageRegistry|Published by %{author}, %{date}
sv: Publicerad av %{author}, %{date}

source: PackageRegistry|Published to %{projectName} by %{author}, %{date}
sv: Publicerad till %{projectName} av %{author}, %{date}

source: PackageRegistry|Published to %{projectName}, %{date}
sv: Publicerad till %{projectName}, %{date}

source: PackageRegistry|Published to the %{project} Terraform Module Registry %{datetime}
sv: Publicerad i Terraform-modulregistret för %{project} %{datetime}

source: PackageRegistry|Published to the %{project} package registry %{datetime}
sv: Publicerad i paketregistret för %{project} %{datetime}

source: PackageRegistry|PyPI
sv: PyPI

source: PackageRegistry|Readme
sv: Readme

source: PackageRegistry|Recipe: %{recipe}
sv: Recept: %{recipe}

source: PackageRegistry|Registry setup
sv: Konfiguration av register

source: PackageRegistry|Registry setup command
sv: Kommando för registerkonfiguration

source: PackageRegistry|Remove package
sv: Ta bort paket

source: PackageRegistry|Required Python: %{pythonVersion}
sv: Kräver Python: %{pythonVersion}

source: PackageRegistry|RubyGems
sv: RubyGems

source: PackageRegistry|Show packages with errors
sv: Visa paket med fel

source: PackageRegistry|Skip metadata URL validation for the NuGet package
sv: Hoppa över validering av metadata-URL för NuGet-paketet

source: PackageRegistry|Something went wrong while deleting packages.
sv: Något gick fel när paketen skulle tas bort.

source: PackageRegistry|Something went wrong while deleting the package asset.
sv: Något gick fel när paketresursen skulle tas bort.

source: PackageRegistry|Something went wrong while deleting the package assets.
sv: Något gick fel när paketresurserna skulle tas bort.

source: PackageRegistry|Something went wrong while deleting the package.
sv: Något gick fel när paketet skulle tas bort.

source: PackageRegistry|Something went wrong while fetching package assets.
sv: Något gick fel när paketresurserna skulle hämtas.

source: PackageRegistry|Something went wrong while fetching the package history.
sv: Något gick fel när pakethistoriken skulle hämtas.

source: PackageRegistry|Something went wrong while fetching the package metadata.
sv: Något gick fel när paketmetadata skulle hämtas.

source: PackageRegistry|Something went wrong while saving the package protection rule.
sv: Något gick fel när paketets skyddsregel skulle sparas.

source: PackageRegistry|Sorry, your filter produced no results
sv: Tyvärr gav filtret inga resultat

source: PackageRegistry|Source project located at %{link}
sv: Källprojektet finns på %{link}

source: PackageRegistry|Summary: %{summary}
sv: Sammanfattning: %{summary}

source: PackageRegistry|Target SHA: %{sha}
sv: Mål-SHA: %{sha}

source: PackageRegistry|Terraform module
sv: Terraform-modul

source: PackageRegistry|There are no other versions of this package.
sv: Det finns inga andra versioner av det här paketet.

source: PackageRegistry|There are no packages yet
sv: Det finns inga paket ännu

source: PackageRegistry|There was a problem fetching the details for this package.
sv: Det uppstod ett problem när informationen om paketet skulle hämtas.

source: PackageRegistry|There was an error publishing %{count} packages
sv: Det uppstod ett fel när %{count} paket skulle publiceras

source: PackageRegistry|There was an error publishing %{packageName}
sv: Det uppstod ett fel när %{packageName} skulle publiceras

source: PackageRegistry|This NuGet package has no dependencies.
sv: Det här NuGet-paketet har inga beroenden.

source: PackageRegistry|This package version has been deprecated.
sv: Den här paketversionen har fasats ut.

source: PackageRegistry|To widen your search, change or remove the filters above.
sv: Om du vill utöka sökningen kan du ändra eller ta bort filtren ovan.

source: PackageRegistry|Type
sv: Typ

source: PackageRegistry|Unable to fetch package version information.
sv: Det gick inte att hämta information om paketversionen.

source: PackageRegistry|Unable to load package
sv: Det gick inte att läsa in paketet

source: PackageRegistry|Users with at least the Developer role for this project will be able to publish, edit, and delete packages with this package name.
sv: Användare med minst utvecklarrollen för det här projektet kan publicera, redigera och ta bort paket med det här paketnamnet.

source: PackageRegistry|Validate these URLs manually to ensure malicious packages are not uploaded to the NuGet package registry. Selecting and clearing the checkbox might lead to invalid records in the package registry that you cannot update.
sv: Validera dessa URL:er manuellt för att säkerställa att skadliga paket inte laddas upp till NuGet-paketregistret. Om du markerar och avmarkerar kryssrutan kan ogiltiga poster skapas i paketregistret som du inte kan uppdatera.

source: PackageRegistry|Version %{version} was first created %{datetime}
sv: Version %{version} skapades först %{datetime}

source: PackageRegistry|When a package is protected, only certain user roles can push, update, and delete the protected package, which helps to avoid tampering with the package.
sv: När ett paket är skyddat kan endast vissa användarroller pusha, uppdatera och ta bort det skyddade paketet, vilket hjälper till att undvika manipulering av paketet.

source: PackageRegistry|When a package with same name and version is uploaded to the registry, more assets are added to the package. To save storage space, keep only the most recent assets.
sv: När ett paket med samma namn och version laddas upp till registret läggs fler resurser till i paketet. Behåll bara de nyaste resurserna för att spara lagringsutrymme.

source: PackageRegistry|Yarn
sv: Yarn

source: PackageRegistry|Yarn install command
sv: Yarn-installationskommando

source: PackageRegistry|Yes, delete package
sv: Ja, ta bort paketet

source: PackageRegistry|Yes, delete selected packages
sv: Ja, ta bort valda paket

source: PackageRegistry|You are about to delete %{count} assets. This operation is irreversible.
sv: Du är på väg att ta bort %{count} resurser. Åtgärden kan inte ångras.

source: PackageRegistry|You are about to delete %{count} packages. This operation is irreversible.
sv: Du är på väg att ta bort %{count} paket. Åtgärden kan inte ångras.

source: PackageRegistry|You are about to delete %{filename}. This is a destructive action that may render your package unusable. Are you sure?
sv: Du är på väg att ta bort %{filename}. Detta är en destruktiv åtgärd som kan göra paketet oanvändbart. Är du säker?

source: PackageRegistry|You are about to delete %{name}, are you sure?
sv: Du är på väg att ta bort %{name}. Är du säker?

source: PackageRegistry|You are about to delete the package protection rule for %{packageNamePattern}.
sv: Du är på väg att ta bort paketets skyddsregel för %{packageNamePattern}.

source: PackageRegistry|You are about to delete version %{version} of %{name}. Are you sure?
sv: Du är på väg att ta bort version %{version} av %{name}. Är du säker?

source: PackageRegistry|You will need a %{linkStart}personal access token%{linkEnd}.
sv: Du behöver en %{linkStart}personlig åtkomsttoken%{linkEnd}.

source: PackageRegistry|deprecated
sv: föråldrad

source: PackageRegistry|npm
sv: npm

source: PackageRegistry|npm install command
sv: npm-installationskommando

source: ArtifactRegistry|%{tab} tab for manifest %{digest} of %{name}.
sv: Fliken %{tab} för manifestet %{digest} för %{name}.

source: ArtifactRegistry|%{tab} tab for manifest %{digest}.
sv: Fliken %{tab} för manifestet %{digest}.

source: ArtifactRegistry|A user can hold only one Artifact Registry role per resource. The following are listed more than once.
sv: En användare kan bara ha en Artifact Registry-roll per resurs. Följande visas fler än en gång.

source: ArtifactRegistry|A virtual registry acts as a single access point that routes requests across one or more hosted and remote repositories. %{linkStart}More information%{linkEnd}
sv: Ett virtuellt register fungerar som en gemensam åtkomstpunkt som dirigerar begäranden till ett eller flera lokala och fjärranslutna lagringsplatser. %{linkStart}Mer information%{linkEnd}

source: ArtifactRegistry|Add the registry to your %{codeStart}.npmrc%{codeEnd} file:
sv: Lägg till registret i filen %{codeStart}.npmrc%{codeEnd}:
